In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [9]:
s = pd.Series([1,3,5,np.nan,6,8])

In [10]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

#Read Table Data Into Python

In [11]:
data = pandas.read_csv("people-example.csv")

In [12]:
data

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [15]:
#print the first three rows
data.head(3)

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22

In [16]:
#print the last three rows
data.tail(3)

  First Name Last Name        Country  age
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

#Selecting

In [20]:
#describes the basic statistics of all numerican columns in this case age
data.describe()

             age
count   7.000000
mean   23.142857
std     1.069045
min    22.000000
25%    22.500000
50%    23.000000
75%    23.500000
max    25.000000

In [21]:
data['First Name'].head(3)

0        Bob
1      Alice
2    Malcolm
Name: First Name, dtype: object

In [22]:
data['Country'].tail(3)

4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [25]:
columns_i_want =['First Name','age']
data[columns_i_want] #put them in a data frame

  First Name  age
0        Bob   24
1      Alice   23
2    Malcolm   22
3      Felix   23
4       Alex   23
5        Tod   22
6      Derek   25

In [19]:
data_col = ['First Name','Last Name','Country','age']

#Graphing

In [29]:
plt.hist(data['age'])
plt.title('Age Histogram')
plt.xlabel('Ages')
plt.ylabel('Frequency')
plt.show()

#Manipulating

In [30]:
data['age'].mean()

23.142857142857142

In [31]:
data['age'].max()

25

In [34]:
data['Full Name']= data['First Name'] + ' ' +data['Last Name']

In [35]:
data

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [36]:
data['age'] +data['age']

0    48
1    46
2    44
3    46
4    46
5    44
6    50
Name: age, dtype: int64

#Using the apply function to do advance transformation of our data

In [46]:
data['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [43]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [44]:
transform_country('USA')

'United States'

In [45]:
data['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [47]:
data['Country'] = data['Country'].apply(transform_country)

In [48]:
data

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward